dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
		  switch (state){
		  case state_show_time:
		  case state_set_time:
			  if(curr_status == STATUS_FREE ){
				  flash_mode = 0;
				  state = state_set_time;
				  display_data = ToBCD(time_to_set);
			  } else {
				  state = state_show_time;
//				  time_to_set = 0;
				  display_data = ToBCD(curr_time);
				  if(curr_status == STATUS_WAITING ){
					  flash_mode = 1; // DP flashing
				  } else  if(curr_status == STATUS_WORKING ){
					  flash_mode = 2; // DP cycling
				  } else  if(curr_status == STATUS_COOLING ){
					  flash_mode = 3; // All flashing
				  } else {
					  display_data = 0xEEE;
					  flash_mode = 3; // All flashing
				  }
			  }
			  break;
		  case state_show_hours:

			  if( flash_mode != 3){
				  flash_mode = 3; // All flashing
				  flash_counter_prev = flash_counter = 0;
			  }
			  {
				  int index = (counter_hours)%4;
				  if(index<3){
					  display_data = 0xF00 | ToBCD(work_hours[index]);
				  }
				  else {
					  display_data = 0xFFF;
				  }
				  if(flash_counter_prev != (flash_counter & 0x40)){
					  if(flash_counter_prev) counter_hours++;
					  flash_counter_prev = (flash_counter & 0x40);
				  }
			  }
			  break;
		  case state_enter_service:
			  display_data = service_mode|0xAF0;
		      flash_mode = 0;
			  break;

		  case state_clear_hours:
			  flash_mode = 3;
			  display_data = 0xFFC;
		  	  break;
		  case state_address:
			  flash_mode = 0;
			  display_data = 0xFFA;
			  break;
		  case state_pre_time:
			  flash_mode = 2;
			  display_data = 0x3F0 | preset_pre_time;;
			  break;
		  case state_cool_time:
			  flash_mode = 2;
			  display_data = 0x4F0 | preset_cool_time;
			  break;
		  case state_ext_mode:
			  flash_mode = 0;
			  display_data = 0x5F0;
			  break;
		  }

	  }
}

void push_note(int pitch, int duration){
	end_note = (end_note + 1)&0x3F;
	pitches[end_note] = pitch;
	durations[end_note] = duration;
	TIM6->DIER |= TIM_DIER_UIE; // Enable interrupt on update event
}

void get_next_note(){

	if(start_note == end_note){
		TIM6->DIER &= ~TIM_DIER_UIE; // Disable interrupt on update event
	} else {
		start_note = (start_note + 1)&0x3F;
		TIM6->ARR = pitches[start_note];
		buzz_counter = durations[start_note]*20000/ pitches[start_note];
	}
}

void TIM6_DAC_IRQHandler() {
	if((TIM6->SR & TIM_SR_UIF) != 0) // If update flag is set
		if(buzz_counter){
			buzz_counter--;
			if(buzz_counter & 1)
				GPIOB->BSRR = GPIO_BSRR_BS_9; // Set B9 high
			else
				GPIOB->BRR = GPIO_BSRR_BS_9; // Set B9 low
		}
	TIM6->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
	if(!buzz_counter )	get_next_note();
}

int ToBCD(int value){
	int digits[3];
	int result;
	digits[0] = value %10;
	digits[1] = (value/10) % 10;
	digits[2] = (value/100) % 10;
	result = digits[0] | (digits[1]<<4) | (digits[2]<<8);
	return result;
}

int FromBCD(int value){
	int digits[3];
	int result;
	digits[0] = value & 0x0F;
	digits[1] = (value>>4) & 0x0F;
	digits[2] = (value>>8) & 0x0F;
	result = digits[0] + digits[1]*10 + digits[2]*100;
	return result;
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/**
  * @brief  Manage the activity on sensors when touched/released (example)
  * @param  None
  * @retval None
  */
void ProcessSensors(void)
{

	// TKEY 0
	if (TEST_TKEY(0)||TEST_TKEY(1))
	{
		// LED1_ON;
		if(start_counter< (START_COUNTER_TIME+ ENTER_SERVICE_DELAY + 6*SERVICE_NEXT_DELAY)) start_counter++;
		if(start_counter== START_COUNTER_TIME + ENTER_SERVICE_DELAY){
			if(curr_status == STATUS_FREE &&(state < state_enter_service))
			{
				push_note(C2,4);
				push_note(E2,4);
				push_note(G2,4);
				push_note(C3,4);
				push_note(G2,4);
				push_note(C3,8);
				state = state_enter_service;
				service_mode = mode_clear_hours; // Clear Hours
			}
		}
		if(state == state_enter_service){
			if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 1*SERVICE_NEXT_DELAY){
					service_mode = mode_set_address; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 2*SERVICE_NEXT_DELAY){
				service_mode = mode_set_pre_time; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 3*SERVICE_NEXT_DELAY){
				service_mode = mode_set_cool_time; //
			}
		}
		if(time_to_set && state == state_set_time && start_counter == START_DELAY){
			// Do start
			state = state_show_time;
			push_note(A3,6);
			push_note(A2,4);
			push_note(A3,6);
			send_time();
//			start_counter = 0;
		}
		if(curr_status == STATUS_WAITING && start_counter == START_DELAY){
			// Cancel start
			state = state_show_time;
			push_note(C3,6);
			push_note(A3,4);
			push_note(A2,6);
			time_to_set = 0;
			preset_pre_time = 0;
			preset_cool_time = 0;
			send_time();
			read_eeprom();
//			start_counter = 0;

		}
	}
	else
	{
		if(start_counter){
			if(state == state_show_hours){
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else if(state >= state_enter_service){
				if(state == state_enter_service){
					state = service_mode + state_enter_service;
				}
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else {
				start_counter = 0;

			}
		}
		if(prev_status != curr_status){
			if (prev_status == STATUS_WAITING && curr_status == STATUS_WORKING){
				work_hours[2]+=time_to_set;
				if(work_hours[2]>59){
					work_hours[2]=work_hours[2]-60;
					work_hours[1]++;
					if(work_hours[1]>99){
						work_hours[1] = 0;
						work_hours[0]++;
					}
				}
				write_eeprom();
				time_to_set = 0;
			}
			prev_status = curr_status;

